html/rust/fp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>闭包和迭代器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="grep_example.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">闭包和迭代器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9641ac">闭包：可以捕获环境的匿名函数</a>
<ul>
<li><a href="#org3063d01">使用闭包创建行为的抽象</a>
<ul>
<li><a href="#org7ff8e8e">使用函数重构</a></li>
<li><a href="#org6978d79">重构使用闭包储存代码</a></li>
</ul>
</li>
<li><a href="#orgfd07fca">闭包类型推断和注解</a></li>
<li><a href="#org8f99a3f">使用带有泛型和 Fn trait 的闭包</a>
<ul>
<li><a href="#org6e870a3">Cacher的限制</a></li>
</ul>
</li>
<li><a href="#org1fe0f77">闭包会捕获其环境</a>
<ul>
<li><a href="#org996e8fb">闭包的类型</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org26338e0">迭代器</a>
<ul>
<li><a href="#orgfe31747">Iterator trait 和 next 方法</a></li>
<li><a href="#org315fe3f">消费迭代器的方法</a></li>
<li><a href="#orgfca12df">产生其他迭代器的方法</a></li>
<li><a href="#org2c04e4b">使用闭包获取环境</a></li>
<li><a href="#org93343a2">创建自定义迭代器</a>
<ul>
<li><a href="#org88e1f76">使用 Counter 迭代器的 next 方法</a></li>
<li><a href="#org42ef8a0">使用自定义迭代器中其他 Iterator trait 方法</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4fefb69">改进 minigrep 项目</a>
<ul>
<li><a href="#org4fe701f">使用迭代器并去掉 clone</a>
<ul>
<li><a href="#orgb138c51">直接使用 env::args 返回的迭代器</a></li>
</ul>
</li>
<li><a href="#org5f45459">使用迭代器适配器来使代码更简明</a></li>
</ul>
</li>
<li><a href="#orgabf509a">性能对比：循环 VS 迭代器</a></li>
<li><a href="#org5bf3326">总结</a></li>
</ul>
</div>
</div>
<p>
Rust 的设计灵感来源于很多现存的语言和技术。其中一个显著的影响就是 <span class="underline">函数式编程</span> 。通常包含：
</p>
<ul class="org-ul">
<li>将函数作为 <span class="underline">参数值</span> 或其他函数的 <span class="underline">返回值</span></li>
<li>将函数赋值给 <span class="underline">变量</span> 以供之后执行</li>
<li>&#x2026;&#x2026;</li>
</ul>

<pre class="example">
本章不会讨论函数式编程是或不是什么的问题，而是展示 Rust 的一些在功能上与其他被认为是函数式语言类似的特性
</pre>
<p>
更具体的，将要涉及：
</p>
<ul class="org-ul">
<li><span class="underline">闭包</span> ：一个可以储存在变量里的类似函数的结构</li>
<li><span class="underline">迭代器</span> ：一种处理元素序列的方式</li>
<li>如何使用这些功能来改进前面的minigrep项目</li>
<li>这两个功能的性能</li>
</ul>

<pre class="example">
  还有其它受函数式风格影响的 Rust 功能，比如模式匹配和枚举，这些已经在其他章节中讲到过了

  掌握闭包和迭代器则是编写符合语言风格的高性能 Rust 代码的重要一环，所以将专门用一整章来讲解他们
</pre>
<div id="outline-container-orgd9641ac" class="outline-2">
<h2 id="orgd9641ac">闭包：可以捕获环境的匿名函数</h2>
<div class="outline-text-2" id="text-orgd9641ac">
<p>
Rust 的 <span class="underline">闭包</span> 是可以 <b>保存</b> 进 <span class="underline">变量</span> 或作为 <span class="underline">参数传递</span> 给其他函数的 <b>匿名函数</b> ：
</p>
<ul class="org-ul">
<li>可以在一个地方 <b>创建</b> 闭包，然后在 <span class="underline">不同的上下文</span> 中 <b>执行</b> <span class="underline">闭包运算</span></li>
<li>不同于函数，闭包允许 <b>捕获</b> <span class="underline">调用者作用域</span> 中的值</li>
</ul>

<p>
接下来将展示闭包的这些功能如何复用代码和自定义行为
</p>
</div>
<div id="outline-container-org3063d01" class="outline-3">
<h3 id="org3063d01">使用闭包创建行为的抽象</h3>
<div class="outline-text-3" id="text-org3063d01">
<pre class="example">
   考虑一下这个假想的情况：在一个通过 app 生成自定义健身计划的初创企业工作，其后端使用 Rust 编写
   
   生成健身计划的算法需要考虑很多不同的因素，比如用户的年龄、身体质量指数、用户喜好、最近的健身活动和用户指定的强度系数
   
   本例中实际的算法并不重要，重要的是这个计算只花费几秒钟。但希望在需要时调用算法，并且只希望调用一次，这样就不会让用户等得太久
</pre>

<p>
这里将通过调用 simulated_expensive_calculation 函数来模拟调用假象的算法，它会打印出 calculating slowly&#x2026;，等待两秒，并接着返回传递给它的数字：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::thread;
<span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::<span style="color: #ffd700;">time</span>::<span style="color: #98f5ff;">Duration</span>;

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">simulated_expensive_calculation</span>(<span style="color: #4eee94;">intensity</span>: <span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">u32</span> {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"calculating slowly..."</span>);
    <span style="color: #ffd700;">thread</span>::sleep(<span style="color: #98f5ff;">Duration</span>::from_secs(2));
    intensity
}
</pre>
</div>

<p>
接下来，main 函数中将会包含本例的健身 app 中的重要部分。这代表当用户请求健身计划时 app 会调用的代码。因为与 app 前端的交互与闭包的使用并不相关，所以将硬编码代表程序输入的值并打印输出。所需的输入有这些：
</p>
<ul class="org-ul">
<li>一个来自用户的 intensity 数字，请求健身计划时指定，它代表用户喜好低强度还是高强度健身</li>
<li>一个随机数，其会在健身计划中生成变化</li>
</ul>

<p>
程序的输出将会是建议的锻炼计划。下面展示了将要使用的 main 函数：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">simulated_user_specified_value</span> = 10;
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">simulated_random_number</span> = 7;

    generate_workout(
        simulated_user_specified_value,
        simulated_random_number
    );
}
</pre>
</div>

<pre class="example">
  出于简单考虑这里硬编码了 simulated_user_specified_value 变量的值为 10 和 simulated_random_number 变量的值为 7

  一个实际的程序会从 app 前端获取强度系数并使用 rand crate 来生成随机数，main 函数使用模拟的输入值调用 generate_workout 函数
</pre>

<p>
现在有了执行上下文，开始编写算法。下面的 generate_workout 函数包含最关心的 app 业务逻辑。本例中余下的代码修改都将在这个函数中进行：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">generate_workout</span>(<span style="color: #4eee94;">intensity</span>: <span style="color: #98f5ff;">u32</span>, <span style="color: #4eee94;">random_number</span>: <span style="color: #98f5ff;">u32</span>) {
    <span style="color: #00bfff; font-weight: bold;">if</span> intensity &lt; 25 {
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Today, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> pushups!"</span>,
            simulated_expensive_calculation(intensity)
        );
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Next, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> situps!"</span>,
            simulated_expensive_calculation(intensity)
        );
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        <span style="color: #00bfff; font-weight: bold;">if</span> random_number == 3 {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #f08080;">println!</span>(
                <span style="color: #deb887;">"Today, run for </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> minutes!"</span>,
                simulated_expensive_calculation(intensity)
            );
        }
    }
}
</pre>
</div>

<p>
generate_workout 函数的期望行为是首先检查用户需要低强度（由小于 25 的系数表示）锻炼还是高强度（25 或以上）锻炼：
</p>
<ul class="org-ul">
<li>低强度锻炼计划会根据由 simulated_expensive_calculation 函数所模拟的复杂算法建议一定数量的俯卧撑和仰卧起坐</li>
<li>如果用户需要高强度锻炼，这里有一些额外的逻辑：
<ul class="org-ul">
<li>如果 app 生成的随机数刚好是 3，app 相反会建议用户稍做休息并补充水分</li>
<li>如果不是，则用户会从复杂算法中得到数分钟跑步的高强度锻炼计划</li>
</ul></li>
</ul>

<p>
这里有多处调用了慢计算函数 simulated_expensive_calculation ：
</p>
<ul class="org-ul">
<li>第一个 if 块调用了 simulated_expensive_calculation 两次，else 中的 if 没有调用它</li>
<li>而第二个 else 中的代码调用了它一次</li>
</ul>

<pre class="example">
  现在这份代码能够应对需求了，但数据科学部门的同学告知将来会对调用 simulated_expensive_calculation 的方式做出一些改变

  为了在要做这些改动的时候简化更新步骤，将重构代码来让它只调用 simulated_expensive_calculation 一次

  同时还希望去掉目前多余的连续两次函数调用，并不希望在计算过程中增加任何其他此函数的调用

  也就是说，不希望在完全无需其结果的情况调用函数，不过仍然希望只调用函数一次
</pre>
</div>
<div id="outline-container-org7ff8e8e" class="outline-4">
<h4 id="org7ff8e8e">使用函数重构</h4>
<div class="outline-text-4" id="text-org7ff8e8e">
<p>
有多种方法可以重构此程序。首先尝试的是将重复的 <span class="underline">simulated_expensive_calculation 函数调用</span> <b>提取</b> 到一个 <span class="underline">变量</span> 中： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">generate_workout</span>(<span style="color: #4eee94;">intensity</span>: <span style="color: #98f5ff;">u32</span>, <span style="color: #4eee94;">random_number</span>: <span style="color: #98f5ff;">u32</span>) {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">expensive_result</span> =
        simulated_expensive_calculation(intensity);

    <span style="color: #00bfff; font-weight: bold;">if</span> intensity &lt; 25 {
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Today, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> pushups!"</span>,
            expensive_result
        );
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Next, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> situps!"</span>,
            expensive_result
        );
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        <span style="color: #00bfff; font-weight: bold;">if</span> random_number == 3 {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #f08080;">println!</span>(
                <span style="color: #deb887;">"Today, run for </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> minutes!"</span>,
                expensive_result
            );
        }
    }
}
</pre>
</div>

<pre class="example">
    这个修改统一了 simulated_expensive_calculation 调用并解决了第一个 if 块中不必要的两次调用函数的问题
    
    不幸的是，现在所有的情况下都需要调用函数并等待结果，包括那个完全不需要这一结果的内部 if 块
</pre>

<p>
希望能够在程序的一个位置指定某些代码，并只在程序的某处 <span class="underline">实际需要结果</span> 的时候 <b>执行</b> 这些 <span class="underline">代码</span> 。这正是闭包的用武之地！
</p>
</div>
</div>
