src/rust/fp.org
*** 重构使用闭包储存代码
    不同于总是在 if 块之前调用 simulated_expensive_calculation 函数并储存其结果，可以定义一个闭包并将其储存在变量中，如下所示。实际上可以选择将整个 simulated_expensive_calculation 函数体移动到这里引入的闭包中：
    
    #+BEGIN_SRC rust 
  let expensive_closure = |num| {
      println!("calculating slowly...");
      thread::sleep(Duration::from_secs(2));
      num
  };
    #+END_SRC
    
    闭包定义是 expensive_closure 赋值的 = 之后的部分：
+ 闭包的定义以一对竖线 _|_ 开始
+ 在竖线中指定闭包的 *参数* 
#+BEGIN_EXAMPLE
  之所以选择这个语法是因为它与 Smalltalk 和 Ruby 的闭包定义类似

  这个闭包有一个参数 num；如果有多于一个参数，可以使用逗号分隔，比如 |param1, param2|
#+END_EXAMPLE
+ 参数之后是存放 *闭包体* 的 _大括号_ ，如果闭包体只有一行则大括号是可以省略的
+ 闭包体的最后一行没有分号（正如函数体一样），所以闭包体最后一行的 _num_ 作为调用闭包时的 _返回值_  
+ 大括号之后闭包的结尾，需要用于 _let 语句的分号_ 
  
#+BEGIN_EXAMPLE
  注意：这个 let 语句意味着 expensive_closure 包含一个匿名函数的定义，而不是调用匿名函数的 返回值

  回忆一下使用闭包的原因是需要在一个位置定义代码，储存代码，并在之后的位置实际调用它

  所以这里期望调用的代码现在储存在 expensive_closure 变量中
#+END_EXAMPLE

定义了闭包之后，可以改变 if 块中的代码来调用闭包以执行代码并获取结果值。调用闭包类似于 _调用函数_ ；指定存放闭包定义的变量名并后跟包含期望使用的参数的括号，如下面所示： 

#+BEGIN_SRC rust 
  fn generate_workout(intensity: u32, random_number: u32) {
      let expensive_closure = |num| {
	  println!("calculating slowly...");
	  thread::sleep(Duration::from_secs(2));
	  num
      };

      if intensity < 25 {
	  println!(
	      "Today, do {} pushups!",
	      expensive_closure(intensity)
	  );
	  println!(
	      "Next, do {} situps!",
	      expensive_closure(intensity)
	  );
      } else {
	  if random_number == 3 {
	      println!("Take a break today! Remember to stay hydrated!");
	  } else {
	      println!(
		  "Today, run for {} minutes!",
		  expensive_closure(intensity)
	      );
	  }
      }
  }
#+END_SRC

现在耗时的计算只在一个地方被调用，并只会在需要结果的时候执行改代码

#+BEGIN_EXAMPLE
  然而，这里又重新引入了上面已经解决的问题：仍然在第一个 if 块中调用了闭包两次，这调用了慢计算代码两次而使得用户需要多等待一倍的时间

  可以通过在 if 块中创建一个本地变量存放闭包调用的结果来解决这个问题，不过闭包可以提供另外一种解决方案

  稍后会讨论这个方案，不过目前首先讨论一下为何闭包定义中和所涉及的 trait 中没有类型注解
#+END_EXAMPLE

** 闭包类型推断和注解
   闭包不要求像 fn 函数那样在 _参数_ 和 _返回值_ 上 *注明* _类型_ 
   
   #+BEGIN_EXAMPLE
   函数中需要类型注解是因为他们是暴露给用户的显式接口的一部分，严格的定义这些接口对于保证所有人都认同函数使用和返回值的类型来说是很重要的
   
   但是闭包并不用于这样暴露在外的接口：他们储存在变量中并被使用，不用命名他们或暴露给库的用户调用
   
   闭包通常很短并只与对应相对任意的场景较小的上下文中。在这些有限制的上下文中，编译器能可靠的推断参数和返回值的类型，类似于它是如何能够推断大部分变量的类型一样
   
   强制在这些小的匿名函数中注明类型是很恼人的，并且与编译器已知的信息存在大量的重复
   #+END_EXAMPLE
   
   类似于变量，如果相比严格的必要性更希望增加明确性并变得更啰嗦，可以选择增加类型注解：
   
   #+BEGIN_SRC rust 
  let expensive_closure = |num: u32| -> u32 {
      println!("calculating slowly...");
      thread::sleep(Duration::from_secs(2));
      num
  };
   #+END_SRC
   
   有了类型注解闭包的语法就更类似函数了。如下是一个对其参数加一的函数的定义与拥有相同行为闭包语法的纵向对比：
   
   #+BEGIN_SRC rust 
  fn  add_one_v1   (x: u32) -> u32 { x + 1 }
  let add_one_v2 = |x: u32| -> u32 { x + 1 };
  let add_one_v3 = |x|             { x + 1 };
  let add_one_v4 = |x|               x + 1  ;
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这展示了闭包语法如何类似于函数语法，除了使用竖线而不是括号以及几个可选的语法之外
   
   1. 第一行展示了一个函数定义
   2. 第二行展示了一个完整标注的闭包定义
   3. 第三行闭包定义中省略了类型注解
   4. 第四行去掉了可选的大括号，因为闭包体只有一行
   
   这些都是有效的闭包定义，并在调用时产生相同的行为
   
   这里增加了一些空格来对齐相应部分
   #+END_EXAMPLE
   
   闭包定义会为每个参数和返回值推断一个具体类型。例如，下面展示了仅仅将参数作为返回值的简短的闭包定义
   
   #+BEGIN_SRC rust 
  let example_closure = |x| x;

  let s = example_closure(String::from("hello"));
  let n = example_closure(5);
   #+END_SRC
   
   如果尝试调用闭包两次，第一次使用 String 类型作为参数而第二次使用 u32，则会得到一个错误：
   
   #+BEGIN_SRC sh 
  error[E0308]: mismatched types
   --> src/main.rs
    |
    | let n = example_closure(5);
    |                         ^ expected struct `std::string::String`, found
    integer
    |
    = note: expected type `std::string::String`
	       found type `{integer}`
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   第一次使用 String 值调用 example_closure 时，编译器推断 x 和此闭包返回值的类型为 String
   
   接着这些类型被锁定进闭包 example_closure 中，如果尝试对同一闭包使用不同类型则会得到类型错误
   #+END_EXAMPLE
   
