html/rust/fp.html
<div id="outline-container-org6978d79" class="outline-4">
<h4 id="org6978d79">重构使用闭包储存代码</h4>
<div class="outline-text-4" id="text-org6978d79">
<p>
不同于总是在 if 块之前调用 simulated_expensive_calculation 函数并储存其结果，可以定义一个闭包并将其储存在变量中，如下所示。实际上可以选择将整个 simulated_expensive_calculation 函数体移动到这里引入的闭包中：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">expensive_closure</span> = |num| {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"calculating slowly..."</span>);
    <span style="color: #ffd700;">thread</span>::sleep(<span style="color: #98f5ff;">Duration</span>::from_secs(2));
    num
};
</pre>
</div>

<p>
闭包定义是 expensive_closure 赋值的 = 之后的部分：
</p>
<ul class="org-ul">
<li>闭包的定义以一对竖线 <span class="underline">|</span> 开始</li>
<li>在竖线中指定闭包的 <b>参数</b></li>
</ul>
<pre class="example">
  之所以选择这个语法是因为它与 Smalltalk 和 Ruby 的闭包定义类似

  这个闭包有一个参数 num；如果有多于一个参数，可以使用逗号分隔，比如 |param1, param2|
</pre>
<ul class="org-ul">
<li>参数之后是存放 <b>闭包体</b> 的 <span class="underline">大括号</span> ，如果闭包体只有一行则大括号是可以省略的</li>
<li>闭包体的最后一行没有分号（正如函数体一样），所以闭包体最后一行的 <span class="underline">num</span> 作为调用闭包时的 <span class="underline">返回值</span></li>
<li>大括号之后闭包的结尾，需要用于 <span class="underline">let 语句的分号</span></li>
</ul>

<pre class="example">
  注意：这个 let 语句意味着 expensive_closure 包含一个匿名函数的定义，而不是调用匿名函数的 返回值

  回忆一下使用闭包的原因是需要在一个位置定义代码，储存代码，并在之后的位置实际调用它

  所以这里期望调用的代码现在储存在 expensive_closure 变量中
</pre>

<p>
定义了闭包之后，可以改变 if 块中的代码来调用闭包以执行代码并获取结果值。调用闭包类似于 <span class="underline">调用函数</span> ；指定存放闭包定义的变量名并后跟包含期望使用的参数的括号，如下面所示： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">generate_workout</span>(<span style="color: #4eee94;">intensity</span>: <span style="color: #98f5ff;">u32</span>, <span style="color: #4eee94;">random_number</span>: <span style="color: #98f5ff;">u32</span>) {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">expensive_closure</span> = |num| {
        <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"calculating slowly..."</span>);
        <span style="color: #ffd700;">thread</span>::sleep(<span style="color: #98f5ff;">Duration</span>::from_secs(2));
        num
    };

    <span style="color: #00bfff; font-weight: bold;">if</span> intensity &lt; 25 {
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Today, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> pushups!"</span>,
            expensive_closure(intensity)
        );
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Next, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> situps!"</span>,
            expensive_closure(intensity)
        );
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        <span style="color: #00bfff; font-weight: bold;">if</span> random_number == 3 {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #f08080;">println!</span>(
                <span style="color: #deb887;">"Today, run for </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> minutes!"</span>,
                expensive_closure(intensity)
            );
        }
    }
}
</pre>
</div>

<p>
现在耗时的计算只在一个地方被调用，并只会在需要结果的时候执行改代码
</p>

<pre class="example">
  然而，这里又重新引入了上面已经解决的问题：仍然在第一个 if 块中调用了闭包两次，这调用了慢计算代码两次而使得用户需要多等待一倍的时间

  可以通过在 if 块中创建一个本地变量存放闭包调用的结果来解决这个问题，不过闭包可以提供另外一种解决方案

  稍后会讨论这个方案，不过目前首先讨论一下为何闭包定义中和所涉及的 trait 中没有类型注解
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd07fca" class="outline-3">
<h3 id="orgfd07fca">闭包类型推断和注解</h3>
<div class="outline-text-3" id="text-orgfd07fca">
<p>
闭包不要求像 fn 函数那样在 <span class="underline">参数</span> 和 <span class="underline">返回值</span> 上 <b>注明</b> <span class="underline">类型</span> 
</p>

<pre class="example">
   函数中需要类型注解是因为他们是暴露给用户的显式接口的一部分，严格的定义这些接口对于保证所有人都认同函数使用和返回值的类型来说是很重要的
   
   但是闭包并不用于这样暴露在外的接口：他们储存在变量中并被使用，不用命名他们或暴露给库的用户调用
   
   闭包通常很短并只与对应相对任意的场景较小的上下文中。在这些有限制的上下文中，编译器能可靠的推断参数和返回值的类型，类似于它是如何能够推断大部分变量的类型一样
   
   强制在这些小的匿名函数中注明类型是很恼人的，并且与编译器已知的信息存在大量的重复
</pre>

<p>
类似于变量，如果相比严格的必要性更希望增加明确性并变得更啰嗦，可以选择增加类型注解：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">expensive_closure</span> = |<span style="color: #4eee94;">num</span>: <span style="color: #98f5ff;">u32</span>| -&gt; <span style="color: #98f5ff;">u32</span> {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"calculating slowly..."</span>);
    <span style="color: #ffd700;">thread</span>::sleep(<span style="color: #98f5ff;">Duration</span>::from_secs(2));
    num
};
</pre>
</div>

<p>
有了类型注解闭包的语法就更类似函数了。如下是一个对其参数加一的函数的定义与拥有相同行为闭包语法的纵向对比：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span>  <span style="color: #daa520; font-weight: bold;">add_one_v1</span>   (<span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">u32</span> { x + 1 }
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">add_one_v2</span> = |<span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">u32</span>| -&gt; <span style="color: #98f5ff;">u32</span> { x + 1 };
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">add_one_v3</span> = |x|             { x + 1 };
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">add_one_v4</span> = |x|               x + 1  ;
</pre>
</div>

<pre class="example">
这展示了闭包语法如何类似于函数语法，除了使用竖线而不是括号以及几个可选的语法之外

1. 第一行展示了一个函数定义
2. 第二行展示了一个完整标注的闭包定义
3. 第三行闭包定义中省略了类型注解
4. 第四行去掉了可选的大括号，因为闭包体只有一行

这些都是有效的闭包定义，并在调用时产生相同的行为

这里增加了一些空格来对齐相应部分
</pre>

<p>
闭包定义会为每个参数和返回值推断一个具体类型。例如，下面展示了仅仅将参数作为返回值的简短的闭包定义
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">example_closure</span> = |x| x;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = example_closure(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"hello"</span>));
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">n</span> = example_closure(5);
</pre>
</div>

<p>
如果尝试调用闭包两次，第一次使用 String 类型作为参数而第二次使用 u32，则会得到一个错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0308]: mismatched types
 --&gt; src/main.rs
  |
  | <span style="color: #f08080;">let</span> n = example_closure(5);
  |                         ^ expected struct <span style="color: #fa8072;">`std::string::String`</span>, found
  integer
  |
  = note: expected type <span style="color: #fa8072;">`std::string::String`</span>
             found type <span style="color: #fa8072;">`{integer}`</span>
</pre>
</div>

<pre class="example">
   第一次使用 String 值调用 example_closure 时，编译器推断 x 和此闭包返回值的类型为 String
   
   接着这些类型被锁定进闭包 example_closure 中，如果尝试对同一闭包使用不同类型则会得到类型错误
</pre>
</div>
</div>
