html/rust/fp.html

<div id="outline-container-org8f99a3f" class="outline-3">
<h3 id="org8f99a3f">使用带有泛型和 Fn trait 的闭包</h3>
<div class="outline-text-3" id="text-org8f99a3f">
<pre class="example">
   回到前面的健身计划生成 app ，使用了闭包后的代码仍然调用了多于需要的慢计算闭包
   
   解决这个问题的一个方法是在全部代码中的每一个需要多个慢计算闭包结果的地方，可以将结果保存进变量以供复用，这样就可以使用变量而不是再次调用闭包
   
   但是这样就会有很多重复的保存结果变量的地方
</pre>

<p>
还有另一个可用的方案。可以创建一个 <b>存放</b> <span class="underline">闭包</span> 和 <b>调用</b> 闭包 <span class="underline">结果</span> 的 <b>结构体</b> 
</p>

<pre class="example">
   该结构体只会在需要结果时执行闭包，并会缓存结果值，这样余下的代码就不必再负责保存结果并可以复用该值
   
   这种模式被称 memoization 或 lazy evaluation
</pre>

<p>
为了让结构体存放闭包，需要 <b>指定</b> 闭包的 <span class="underline">类型</span> ，因为 <span class="underline">结构体定义</span> 需要知道其 <span class="underline">每一个字段的类型</span>
</p>
<pre class="example">
   每一个闭包实例有其自己独有的匿名类型：也就是说，即便两个闭包有着相同的签名，他们的类型仍然可以被认为是不同
</pre>
<p>
为了定义使用闭包的结构体、枚举或函数参数，需要使用 <span class="underline">泛型</span> 和 <span class="underline">trait bound</span> 
</p>
<ul class="org-ul">
<li><span class="underline">Fn 系列 trait</span> 由标准库提供</li>
</ul>
<pre class="example">
  所有的闭包都实现了 Fn、FnMut 或 FnOnce Trait中的一个，在 “闭包会捕获其环境” 部分会讨论这些 trait 的区别

  在这个例子中可以使用 Fn trait
</pre>

<ul class="org-ul">
<li>为了满足 Fn trait bound 增加了代表闭包所必须的 <span class="underline">参数</span> 和 <span class="underline">返回值类型</span> 的 <b>类型</b></li>
</ul>

<pre class="example">
  在这个例子中，闭包有一个 u32 的参数并返回一个 u32

  这样所指定的 trait bound 就是 Fn(u32) -&gt; u32
</pre>

<p>
下面展示了存放了 <span class="underline">闭包</span> 和一个 <span class="underline">Option 结果值</span> 的  <span class="underline">Cacher 结构体</span> 的定义：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Cacher</span>&lt;<span style="color: #98f5ff;">T</span>&gt;
    <span style="color: #00bfff; font-weight: bold;">where</span> <span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Fn</span>(<span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">u32</span>
{
    <span style="color: #4eee94;">calculation</span>: <span style="color: #98f5ff;">T</span>,
    <span style="color: #4eee94;">value</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">u32</span>&gt;,
}
</pre>
</div>


<p>
结构体 Cacher：
</p>
<ul class="org-ul">
<li>一个 <span class="underline">泛型 T</span> 的字段 <span class="underline">calculation</span> 
<ul class="org-ul">
<li>T 的 trait bound 指定了 T 是一个使用 <span class="underline">Fn 的闭包</span> 
<ul class="org-ul">
<li>任何希望储存到 Cacher 实例的 calculation 字段的闭包必须有一个 u32 参数（由 Fn 之后的括号的内容指定）</li>
<li>必须返回一个 u32（由 -&gt; 之后的内容）</li>
</ul></li>
</ul></li>
</ul>
<pre class="example">
  注意：函数也都实现了这三个 Fn trait

  如果不需要捕获环境中的值，则可以使用实现了 Fn trait 的函数而不是闭包
</pre>
<ul class="org-ul">
<li>字段 <span class="underline">value</span> 是 <span class="underline">Option&lt;u32&gt;</span> 类型的：
<ul class="org-ul">
<li>在执行闭包之前，value 将是 <span class="underline">None</span></li>
<li>如果使用 Cacher 的代码请求闭包的结果，这时会执行闭包并将结果 <b>储存</b> 在 value 字段的 <span class="underline">Some 成员</span> 中
<ul class="org-ul">
<li>如果代码再次请求闭包的结果，这时不再执行闭包，而是会 <b>返回</b> 存放在 <span class="underline">Some 成员</span> 中的 <b>结果</b></li>
</ul></li>
</ul></li>
</ul>

<p>
实现Cacher的逻辑如下：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span>&lt;<span style="color: #98f5ff;">T</span>&gt; <span style="color: #98f5ff;">Cacher</span>&lt;<span style="color: #98f5ff;">T</span>&gt;
    <span style="color: #00bfff; font-weight: bold;">where</span> <span style="color: #4eee94;">T</span>: <span style="color: #98f5ff;">Fn</span>(<span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">u32</span>
{
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">new</span>(<span style="color: #4eee94;">calculation</span>: <span style="color: #98f5ff;">T</span>) -&gt; <span style="color: #98f5ff;">Cacher</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
        <span style="color: #98f5ff;">Cacher</span> {
            calculation,
            <span style="color: #4eee94;">value</span>: <span style="color: #98f5ff;">None</span>,
        }
    }

    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">value</span>(&amp;<span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #00bfff; font-weight: bold;">self</span>, <span style="color: #4eee94;">arg</span>: <span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">u32</span> {
        <span style="color: #00bfff; font-weight: bold;">match</span> <span style="color: #00bfff; font-weight: bold;">self</span>.value {
            <span style="color: #98f5ff;">Some</span>(v) =&gt; v,
            <span style="color: #98f5ff;">None</span> =&gt; {
                <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = (<span style="color: #00bfff; font-weight: bold;">self</span>.calculation)(arg);
                <span style="color: #00bfff; font-weight: bold;">self</span>.value = <span style="color: #98f5ff;">Some</span>(v);
                v
            },
        }
    }
}
</pre>
</div>

<ol class="org-ol">
<li>Cacher 结构体的 <span class="underline">字段</span> 是 <b>私有</b> 的，因为希望 Cacher 管理这些值而不是任由调用代码潜在的直接改变他们</li>
<li><span class="underline">Cacher::new</span> 函数：
<ul class="org-ul">
<li>获取一个 <span class="underline">泛型参数 T</span> ，它定义于 <span class="underline">impl 块上下文</span> 中并与 Cacher 结构体有着相同的 trait bound</li>
<li>返回一个在Cacher实例，此时闭包还没有被执行
<ul class="org-ul">
<li><span class="underline">calculation 字段</span> 中 <b>存放</b> 了 <span class="underline">指定闭包</span></li>
<li><span class="underline">value 字段</span> 中 存放了 <span class="underline">None</span> 值</li>
</ul></li>
</ul></li>
<li>当调用代码需要闭包的执行结果时，不同于直接调用闭包，它会调用 <span class="underline">value</span> 方法： <b>检查</b> <span class="underline">self.value</span> 是否 <b>已经有</b> 了一个 <span class="underline">Some</span> 的结果值；
<ul class="org-ul">
<li>如果有：返回 Some 中的值并不会再次执行闭包</li>
<li>如果 self.value 是 None：会调用 self.calculation 中储存的闭包，将结果保存到 self.value 以便将来使用，并同时返回结果值</li>
</ul></li>
</ol>

<p>
下面代码展示了如何在 generate_workout 函数中利用 Cacher 结构体：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">generate_workout</span>(<span style="color: #4eee94;">intensity</span>: <span style="color: #98f5ff;">u32</span>, <span style="color: #4eee94;">random_number</span>: <span style="color: #98f5ff;">u32</span>) {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">expensive_result</span> = <span style="color: #98f5ff;">Cacher</span>::new(|num| {
        <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"calculating slowly..."</span>);
        <span style="color: #ffd700;">thread</span>::sleep(<span style="color: #98f5ff;">Duration</span>::from_secs(2));
        num
    });

    <span style="color: #00bfff; font-weight: bold;">if</span> intensity &lt; 25 {
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Today, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> pushups!"</span>,
            expensive_result.value(intensity)
        );
        <span style="color: #f08080;">println!</span>(
            <span style="color: #deb887;">"Next, do </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> situps!"</span>,
            expensive_result.value(intensity)
        );
    } <span style="color: #00bfff; font-weight: bold;">else</span> {
        <span style="color: #00bfff; font-weight: bold;">if</span> random_number == 3 {
            <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #f08080;">println!</span>(
                <span style="color: #deb887;">"Today, run for </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;"> minutes!"</span>,
                expensive_result.value(intensity)
            );
        }
    }
}
</pre>
</div>

<ol class="org-ol">
<li>不同于直接将闭包保存进一个变量，保存一个新的 Cacher 实例来存放闭包</li>
<li>在每一个需要结果的地方，调用 Cacher 实例的 value 方法</li>
<li>可以调用 value 方法任意多次，或者一次也不调用，而慢计算最多只会运行一次。</li>
</ol>

<pre class="example">
改变 simulated_user_specified_value 和 simulated_random_number 变量中的值来验证在所有情况下在多个 if 和 else 块中，闭包打印的 calculating slowly... 只会在需要时出现并只会出现一次

Cacher 负责确保不会调用超过所需的慢计算所需的逻辑，这样 generate_workout 就可以专注业务逻辑了
</pre>
</div>

<div id="outline-container-org6e870a3" class="outline-4">
<h4 id="org6e870a3">Cacher的限制</h4>
<div class="outline-text-4" id="text-org6e870a3">
<pre class="example">
    值缓存是一种更加广泛的实用行为，可能希望在代码中的其他闭包中也使用他们
    
    然而，目前 Cacher 的实现存在两个小问题，这使得在不同上下文中复用变得很困难
</pre>

<p>
第一个问题是 Cacher 实例假设对于 value 方法的任何 arg 参数值总是会返回相同的值。也就是说，这个 Cacher 的测试会失败：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">call_with_different_values</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">c</span> = <span style="color: #98f5ff;">Cacher</span>::new(|a| a);

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span> = c.value(1);
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v2</span> = c.value(2);

    <span style="color: #ffd700;">assert_eq!</span>(v2, 2);
}
</pre>
</div>

<p>
上面代码运行测试，它会在 assert_eq! 失败并显示如下信息：
</p>

<div class="org-src-container">
<pre class="src src-sh">thread <span style="color: #deb887;">'call_with_different_values'</span> panicked at <span style="color: #deb887;">'assertion failed: `(left == right)`</span>
<span style="color: #deb887;">  left: `1`,</span>
<span style="color: #deb887;"> right: `2`'</span>, src/main.rs
</pre>
</div>

<pre class="example">
    这里的问题是第一次使用 1 调用 c.value，Cacher 实例将 Some(1) 保存进 self.value。在这之后，无论传递什么值调用 value，它总是会返回 1
    
    可以修改 Cacher 存放一个哈希 map 而不是单独一个值。哈希 map 的 key 将是传递进来的 arg 值，而 value 则是对应 key 调用闭包的结果值
    
    相比之前检查 self.value 直接是 Some 还是 None 值，现在 value 函数会在哈希 map 中寻找 arg：
    
    如果找到的话就返回其对应的值，如果不存在，Cacher 会调用闭包并将结果值保存在哈希 map 对应 arg 值的位置
</pre>

<p>
当前 Cacher 实现的第二个问题是它的应用被限制为只 <b>接受</b> 获取一个 <span class="underline">u32</span> 值并 <b>返回</b> 一个 <span class="underline">u32</span> 值的闭包
</p>

<pre class="example">
    比如说，可能需要能够缓存一个获取字符串 slice 并返回 usize 值的闭包的结果
    
    这需要引入更多泛型参数来增加 Cacher 功能的灵活性
</pre>
</div>
</div>
</div>
