src/rust/fp.org
** 闭包会捕获其环境
   #+BEGIN_EXAMPLE
   在健身计划生成器的例子中，我们只将闭包作为内联匿名函数来使用
   #+END_EXAMPLE
   闭包还有另一个函数所没有的功能：他们可以 *捕获* 其 _环境_ 并访问其被 *定义的作用域* 的 _变量_ 。比如：有一个储存在 equal_to_x 变量中闭包的例子，它使用了闭包环境中的变量 x：
   
   #+BEGIN_SRC rust 
  fn main() {
      let x = 4;

      let equal_to_x = |z| z == x;

      let y = 4;

      assert!(equal_to_x(y));
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这里，即便 x 并不是 equal_to_x 的一个参数，equal_to_x 闭包也被允许使用变量 x，因为它与 equal_to_x 定义于相同的作用域
   #+END_EXAMPLE
   
   函数则不能做到同样的事，如果尝试如下例子，它并不能编译：
   
   #+BEGIN_SRC rust 
  fn main() {
      let x = 4;

      fn equal_to_x(z: i32) -> bool { z == x }

      let y = 4;

      assert!(equal_to_x(y));
  }
   #+END_SRC
   
   这会得到一个编译错误：
   #+BEGIN_SRC sh 
  error[E0434]: can't capture dynamic environment in a fn item; use the || { ...
  } closure form instead
   --> src/main.rs
    |
  4 |     fn equal_to_x(z: i32) -> bool { z == x }
   #+END_SRC
   
   当闭包从环境中捕获一个值，闭包会在闭包体中储存这个值以供使用。这会使用内存并产生额外的开销
   
*** 闭包的类型
    #+BEGIN_EXAMPLE
    在更一般的场景中，当不需要闭包来捕获环境时，并不希望产生这些开销
    
    因为函数从未允许捕获环境，定义和使用函数也就从不会有这些额外开销
    #+END_EXAMPLE
    
    闭包可以通过三种方式捕获其环境，他们直接对应函数的三种获取参数的方式： _获取所有权_ ， _可变借用_ 和 _不可变借用_ 。这三种捕获值的方式被编码为如下三个 Fn trait：
1. _FnOnce_ : 消费从周围作用域捕获的变量
  + _闭包周围的作用域_ 被称为其 *环境*
  + 为了消费捕获到的变量，闭包必须 *获取其所有权* 并在 _定义_ 闭包时将其 *移动* 进闭包
  + 名称的 Once 部分代表了闭包 *不能多次* 获取相同变量的所有权的，所以它只能被调用一次
2. _FnMut_ : 获取 _可变的借用_ 值所以可以改变其环境
3. _Fn_ : 从其环境获取 _不可变的借用_ 值
   
当创建一个闭包时，Rust 根据其 _如何使用环境中变量_ 来 *推断* 希望 _如何引用环境_ 
+ 由于所有闭包都可以被调用至少一次，所以所有闭包都实现了 FnOnce
+ 那些并没有移动被捕获变量的所有权到闭包内的闭包也实现了 FnMut
+ 而不需要对被捕获的变量进行可变访问的闭包则也实现了 Fn
  
#+BEGIN_EXAMPLE
  在示例 13-12 中，equal_to_x 闭包不可变的借用了 x（所以 equal_to_x 具有 Fn trait），因为闭包体只需要读取 x 的值
#+END_EXAMPLE

如果希望 *强制* 闭包获取其使用的 *环境值的所有权* ，可以在参数列表前使用 _move_ 关键字

#+BEGIN_EXAMPLE
  这个技巧在将闭包传递给新线程以便将数据移动到新线程中时最为实用
#+END_EXAMPLE

下面在闭包定义中增加 move 关键字并使用 vector 代替整型
#+BEGIN_SRC rust 
  fn main() {
      let x = vec![1, 2, 3];

      let equal_to_x = move |z| z == x;

      println!("can't use x here: {:?}", x);

      let y = vec![1, 2, 3];

      assert!(equal_to_x(y));
  }
#+END_SRC

这个例子并不能编译，会产生以下错误：

#+BEGIN_SRC sh 
  error[E0382]: use of moved value: `x`
   --> src/main.rs:6:40
    |
  4 |     let equal_to_x = move |z| z == x;
    |                      -------- value moved (into closure) here
  5 |
  6 |     println!("can't use x here: {:?}", x);
    |                                        ^ value used here after move
    |
    = note: move occurs because `x` has type `std::vec::Vec<i32>`, which does not
    implement the `Copy` trait
#+END_SRC

#+BEGIN_EXAMPLE
  x 被移动进了闭包，因为闭包使用 move 关键字定义

  闭包获取了 x 的所有权以后， 接下来就不再允许在 println! 语句中使用 x 了

  去掉 println! 即可修复问题
#+END_EXAMPLE

大部分需要指定一个 Fn 系列 trait bound 的时候，可以从 Fn 开始，而编译器会根据闭包体中的情况告诉你是否需要 FnMut 或 FnOnce

* 迭代器
  _迭代器_ 负责 *遍历* 序列中的 _每一项_ 和 *决定* 序列何时 _结束_ 的逻辑。当使用迭代器时，无需重新实现这些逻辑
  
  #+BEGIN_EXAMPLE
  迭代器模式允许对一个项的序列进行某些处理
  #+END_EXAMPLE
  
  在 Rust 中，迭代器是 惰性的，这意味着在调用方法使用迭代器之前它都不会有效果。例如，下面通过调用定义于 Vec 上的 _iter_ 方法在一个 vector v1 上 *创建* 了一个迭代器。这段代码本身没有任何用处：
  
  #+BEGIN_SRC rust 
  let v1 = vec![1, 2, 3];

  let v1_iter = v1.iter();
  #+END_SRC
  
  
  一旦创建迭代器之后，可以选择用多种方式利用它
  
  #+BEGIN_EXAMPLE
  前面已经使用迭代器和 for 循环在每一个项上执行了一些代码
  
  虽然直到现在为止一直没有具体讨论调用 iter 到底具体做了什么
  #+END_EXAMPLE
  
  下面的例子将迭代器的创建和 for 循环中的使用分开。迭代器被储存在 v1_iter 变量中，但这时没有进行迭代。一旦 for 循环开始使用 v1_iter，接着迭代器中的每一个元素被用于循环的一次迭代，这会打印出其每一个值：
  
  #+BEGIN_SRC rust 
  let v1 = vec![1, 2, 3];

  let v1_iter = v1.iter();

  for val in v1_iter {
      println!("Got: {}", val);
  }
  #+END_SRC
  
  #+BEGIN_EXAMPLE
  在标准库中没有提供迭代器的语言中，可能会使用一个从 0 开始的索引变量，使用这个变量索引 vector 中的值，并循环增加其值直到达到 vector 的元素数量
  
  迭代器处理了所有这些逻辑，这减少了重复代码并消除了潜在的混乱
  
  另外，迭代器的实现方式提供了对多种不同的序列使用相同逻辑的灵活性，而不仅仅是像 vector 这样可索引的数据结构
  #+END_EXAMPLE
  
