html/rust/fp.html

<div id="outline-container-org1fe0f77" class="outline-3">
<h3 id="org1fe0f77">闭包会捕获其环境</h3>
<div class="outline-text-3" id="text-org1fe0f77">
<pre class="example">
   在健身计划生成器的例子中，我们只将闭包作为内联匿名函数来使用
</pre>
<p>
闭包还有另一个函数所没有的功能：他们可以 <b>捕获</b> 其 <span class="underline">环境</span> 并访问其被 <b>定义的作用域</b> 的 <span class="underline">变量</span> 。比如：有一个储存在 equal_to_x 变量中闭包的例子，它使用了闭包环境中的变量 x：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = 4;

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">equal_to_x</span> = |z| z == x;

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">y</span> = 4;

    <span style="color: #ffd700;">assert!</span>(equal_to_x(y));
}
</pre>
</div>

<pre class="example">
   这里，即便 x 并不是 equal_to_x 的一个参数，equal_to_x 闭包也被允许使用变量 x，因为它与 equal_to_x 定义于相同的作用域
</pre>

<p>
函数则不能做到同样的事，如果尝试如下例子，它并不能编译：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = 4;

    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">equal_to_x</span>(<span style="color: #4eee94;">z</span>: <span style="color: #98f5ff;">i32</span>) -&gt; <span style="color: #98f5ff;">bool</span> { z == x }

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">y</span> = 4;

    <span style="color: #ffd700;">assert!</span>(equal_to_x(y));
}
</pre>
</div>

<p>
这会得到一个编译错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0434]: can<span style="color: #deb887;">'t capture dynamic environment in a fn item; use the || { ...</span>
<span style="color: #deb887;">} closure form instead</span>
<span style="color: #deb887;"> --&gt; src/main.rs</span>
<span style="color: #deb887;">  |</span>
<span style="color: #deb887;">4 |     fn equal_to_x(z: i32) -&gt; bool { z == x }</span>
</pre>
</div>

<p>
当闭包从环境中捕获一个值，闭包会在闭包体中储存这个值以供使用。这会使用内存并产生额外的开销
</p>
</div>

<div id="outline-container-org996e8fb" class="outline-4">
<h4 id="org996e8fb">闭包的类型</h4>
<div class="outline-text-4" id="text-org996e8fb">
<pre class="example">
    在更一般的场景中，当不需要闭包来捕获环境时，并不希望产生这些开销
    
    因为函数从未允许捕获环境，定义和使用函数也就从不会有这些额外开销
</pre>

<p>
闭包可以通过三种方式捕获其环境，他们直接对应函数的三种获取参数的方式： <span class="underline">获取所有权</span> ， <span class="underline">可变借用</span> 和 <span class="underline">不可变借用</span> 。这三种捕获值的方式被编码为如下三个 Fn trait：
</p>
<ol class="org-ol">
<li><span class="underline">FnOnce</span> : 消费从周围作用域捕获的变量
<ul class="org-ul">
<li><span class="underline">闭包周围的作用域</span> 被称为其 <b>环境</b></li>
<li>为了消费捕获到的变量，闭包必须 <b>获取其所有权</b> 并在 <span class="underline">定义</span> 闭包时将其 <b>移动</b> 进闭包</li>
<li>名称的 Once 部分代表了闭包 <b>不能多次</b> 获取相同变量的所有权的，所以它只能被调用一次</li>
</ul></li>
<li><span class="underline">FnMut</span> : 获取 <span class="underline">可变的借用</span> 值所以可以改变其环境</li>
<li><span class="underline">Fn</span> : 从其环境获取 <span class="underline">不可变的借用</span> 值</li>
</ol>

<p>
当创建一个闭包时，Rust 根据其 <span class="underline">如何使用环境中变量</span> 来 <b>推断</b> 希望 <span class="underline">如何引用环境</span> 
</p>
<ul class="org-ul">
<li>由于所有闭包都可以被调用至少一次，所以所有闭包都实现了 FnOnce</li>
<li>那些并没有移动被捕获变量的所有权到闭包内的闭包也实现了 FnMut</li>
<li>而不需要对被捕获的变量进行可变访问的闭包则也实现了 Fn</li>
</ul>

<pre class="example">
  在示例 13-12 中，equal_to_x 闭包不可变的借用了 x（所以 equal_to_x 具有 Fn trait），因为闭包体只需要读取 x 的值
</pre>

<p>
如果希望 <b>强制</b> 闭包获取其使用的 <b>环境值的所有权</b> ，可以在参数列表前使用 <span class="underline">move</span> 关键字
</p>

<pre class="example">
  这个技巧在将闭包传递给新线程以便将数据移动到新线程中时最为实用
</pre>

<p>
下面在闭包定义中增加 move 关键字并使用 vector 代替整型
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">equal_to_x</span> = <span style="color: #00bfff; font-weight: bold;">move</span> |z| z == x;

    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"can't use x here: </span><span style="color: #deb887; font-style: italic;">{:?}</span><span style="color: #deb887;">"</span>, x);

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">y</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

    <span style="color: #ffd700;">assert!</span>(equal_to_x(y));
}
</pre>
</div>

<p>
这个例子并不能编译，会产生以下错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0382]: use of moved value: <span style="color: #fa8072;">`x`</span>
 --&gt; src/main.rs:6:40
  |
4 |     <span style="color: #f08080;">let</span> equal_to_x = move |z| z == x;
  |                      -------- value moved (into closure) here
5 |
6 |     println!(<span style="color: #deb887;">"can't use x here: {:?}"</span>, x);
  |                                        ^ value used here after move
  |
  = note: move occurs because <span style="color: #fa8072;">`x`</span> has type <span style="color: #fa8072;">`std::vec::Vec&lt;i32&gt;`</span>, which does not
  implement the <span style="color: #fa8072;">`Copy`</span> trait
</pre>
</div>

<pre class="example">
x 被移动进了闭包，因为闭包使用 move 关键字定义

闭包获取了 x 的所有权以后， 接下来就不再允许在 println! 语句中使用 x 了

去掉 println! 即可修复问题
</pre>

<p>
大部分需要指定一个 Fn 系列 trait bound 的时候，可以从 Fn 开始，而编译器会根据闭包体中的情况告诉你是否需要 FnMut 或 FnOnce
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org26338e0" class="outline-2">
<h2 id="org26338e0">迭代器</h2>
<div class="outline-text-2" id="text-org26338e0">
<p>
<span class="underline">迭代器</span> 负责 <b>遍历</b> 序列中的 <span class="underline">每一项</span> 和 <b>决定</b> 序列何时 <span class="underline">结束</span> 的逻辑。当使用迭代器时，无需重新实现这些逻辑
</p>

<pre class="example">
  迭代器模式允许对一个项的序列进行某些处理
</pre>

<p>
在 Rust 中，迭代器是 惰性的，这意味着在调用方法使用迭代器之前它都不会有效果。例如，下面通过调用定义于 Vec 上的 <span class="underline">iter</span> 方法在一个 vector v1 上 <b>创建</b> 了一个迭代器。这段代码本身没有任何用处：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1_iter</span> = v1.iter();
</pre>
</div>


<p>
一旦创建迭代器之后，可以选择用多种方式利用它
</p>

<pre class="example">
  前面已经使用迭代器和 for 循环在每一个项上执行了一些代码
  
  虽然直到现在为止一直没有具体讨论调用 iter 到底具体做了什么
</pre>

<p>
下面的例子将迭代器的创建和 for 循环中的使用分开。迭代器被储存在 v1_iter 变量中，但这时没有进行迭代。一旦 for 循环开始使用 v1_iter，接着迭代器中的每一个元素被用于循环的一次迭代，这会打印出其每一个值：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1_iter</span> = v1.iter();

<span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">val</span> <span style="color: #00bfff; font-weight: bold;">in</span> v1_iter {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"Got: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, val);
}
</pre>
</div>

<pre class="example">
  在标准库中没有提供迭代器的语言中，可能会使用一个从 0 开始的索引变量，使用这个变量索引 vector 中的值，并循环增加其值直到达到 vector 的元素数量
  
  迭代器处理了所有这些逻辑，这减少了重复代码并消除了潜在的混乱
  
  另外，迭代器的实现方式提供了对多种不同的序列使用相同逻辑的灵活性，而不仅仅是像 vector 这样可索引的数据结构
</pre>
</div>
