src/rust/fp.org
** Iterator trait 和 next 方法
   迭代器都实现了一个叫做 _Iterator_ 的定义于 _标准库_ 的 trait。这个 trait 的定义看起来像这样：
   
   #+BEGIN_SRC rust 
  pub trait Iterator {
      type Item;

      fn next(&mut self) -> Option<Self::Item>;

      // 此处省略了方法的默认实现
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   注意这里有一下还未讲到的新语法：type Item 和 Self::Item，他们定义了 trait 的 关联类型
   
   现在只需知道这段代码表明实现 Iterator trait 要求同时定义一个 Item 类型，这个 Item 类型被用作 next 方法的返回值类型
   
   换句话说，Item 类型将是迭代器返回元素的类型
   #+END_EXAMPLE
   
   _next_ 是 Iterator 实现者被要求定义的唯一方法：
+ next *一次* 返回迭代器中的一个项，封装在 _Some_ 中
+ 当迭代器 *结束* 时，它返回 _None_ 
  
可以直接调用迭代器的 next 方法；
#+BEGIN_SRC rust 
  #[test]
  fn iterator_demonstration() {
      let v1 = vec![1, 2, 3];

      let mut v1_iter = v1.iter();

      assert_eq!(v1_iter.next(), Some(&1));
      assert_eq!(v1_iter.next(), Some(&2));
      assert_eq!(v1_iter.next(), Some(&3));
      assert_eq!(v1_iter.next(), None);
  }
#+END_SRC

注意：v1_iter 必须是 *可变* 的：在迭代器上调用 _next_ 方法 *改变* 了迭代器中用来记录 _序列位置_ 的状态。换句话说，每一个 next 调用都会从迭代器中消费一个项
#+BEGIN_EXAMPLE
  使用 for 循环时无需使 v1_iter 可变因为 for 循环会获取 v1_iter 的所有权并在后台使 v1_iter 可变
#+END_EXAMPLE

另外从 next _调用中得到的值_ 是 vector 的 *不可变引用* 

#+BEGIN_EXAMPLE
  iter 方法生成一个不可变引用的迭代器

  如果需要一个获取 v1 所有权并返回拥有所有权的迭代器，则可以调用 into_iter 而不是 iter

  类似的，如果希望迭代可变引用，则可以调用 iter_mut 而不是 iter
#+END_EXAMPLE

** 消费迭代器的方法
   #+BEGIN_EXAMPLE
   Iterator trait 有一系列不同的由标准库提供默认实现的方法，可以在 Iterator trait 的标准库 API 文档中找到所有这些方法
   
   一些方法在其定义中调用了 next 方法，这也就是为什么在实现 Iterator trait 时要求实现 next 方法的原因
   #+END_EXAMPLE
   这些调用 next 方法的方法被称为 _消费适配器_ ，因为调用他们会消耗迭代器。一个消费适配器的例子是 _sum_ 方法。这个方法获取迭代器的所有权并反复调用 next 来遍历迭代器，因而会消费迭代器。当其遍历每一个项时，它将每一个项加总到一个总和并在迭代完成时返回总和：
   
   #+BEGIN_SRC rust 
  #[test]
  fn iterator_sum() {
      let v1 = vec![1, 2, 3];

      let v1_iter = v1.iter();

      let total: i32 = v1_iter.sum();

      assert_eq!(total, 6);
  }
   #+END_SRC
   
   注意：调用 sum 之后 *不再允许使用* v1_iter， 因为调用 sum 时它会 *获取* _迭代器的所有权_ 
   
** 产生其他迭代器的方法
   Iterator trait 中定义了另一类方法，被称为 _迭代器适配器_ ，他们允许将 _当前迭代器_ 变为 _不同类型的迭代器_ 。可以 _链式_ 调用多个迭代器适配器。不过因为所有的迭代器都是惰性的，必须调用一个消费适配器方法以便获取迭代器适配器调用的结果
   
   下面展示了一个调用迭代器适配器方法 map 的例子，该 map 方法使用 _闭包_ 来调用每个元素以生成新的迭代器。 这里的闭包创建了一个新的迭代器，对其中 vector 中的每个元素都被加 1：
   
   #+BEGIN_SRC rust 
  let v1: Vec<i32> = vec![1, 2, 3];

  v1.iter().map(|x| x + 1);
   #+END_SRC
   
   不过这些代码会产生一个警告：
   
   #+BEGIN_SRC sh 
  warning: unused `std::iter::Map` which must be used: iterator adaptors are lazy
  and do nothing unless consumed
   --> src/main.rs:4:5
    |
  4 |     v1.iter().map(|x| x + 1);
    |     ^^^^^^^^^^^^^^^^^^^^^^^^^
    |
    = note: #[warn(unused_must_use)] on by default
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   上面的代码实际上并没有做任何事；所指定的闭包从未被调用过
   
   警告提醒了：迭代器适配器是惰性的，而这里需要消费迭代器
   #+END_EXAMPLE
   
   为了修复这个警告并消费迭代器获取有用的结果，可以使用 collect 方法。这个方法消费迭代器并将结果收集到一个数据结构中：
   
   #+BEGIN_SRC rust 
  let v1: Vec<i32> = vec![1, 2, 3];

  let v2: Vec<_> = v1.iter().map(|x| x + 1).collect();

  assert_eq!(v2, vec![2, 3, 4]);
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   因为传递给 map 的是一个闭包，可以指定任何希望在遍历的每个元素上执行的操作
   
   这是一个展示如何使用闭包来自定义行为同时又复用 Iterator trait 提供的迭代行为的绝佳例子
   #+END_EXAMPLE
   
** 使用闭包获取环境
   展示一个通过使用 filter 迭代器适配器和捕获环境的闭包的常规用例。迭代器的 _filter_ 方法需要一个使用迭代器的 _每一个项_ 并返回 _布尔值_ 的 _闭包_ ：
+ 如果闭包返回 true：其值将会包含在 filter 提供的新迭代器中
+ 如果闭包返回 false：其值不会包含在结果迭代器中
  
下面展示了使用 filter 和一个捕获环境中变量 shoe_size 的闭包，这样闭包就可以遍历一个 Shoe 结构体集合以便只返回指定大小的鞋子：

#+BEGIN_SRC rust 
  #[derive(PartialEq, Debug)]
  struct Shoe {
      size: u32,
      style: String,
  }

  fn shoes_in_my_size(shoes: Vec<Shoe>, shoe_size: u32) -> Vec<Shoe> {
      shoes.into_iter()
	  .filter(|s| s.size == shoe_size)
	  .collect()
  }

  #[test]
  fn filters_by_size() {
      let shoes = vec![
	  Shoe { size: 10, style: String::from("sneaker") },
	  Shoe { size: 13, style: String::from("sandal") },
	  Shoe { size: 10, style: String::from("boot") },
      ];

      let in_my_size = shoes_in_my_size(shoes, 10);

      assert_eq!(
	  in_my_size,
	  vec![
	      Shoe { size: 10, style: String::from("sneaker") },
	      Shoe { size: 10, style: String::from("boot") },
	  ]
      );
  }
#+END_SRC

shoes_in_my_size 函数获取一个鞋子 vector 的所有权和一个鞋子大小作为参数。它返回一个只包含指定大小鞋子的 vector：
1. shoes_in_my_size 函数体中调用了 into_iter 来创建一个获取 _vector 所有权_ 的迭代器
2. 调用 filter 将这个迭代器适配成一个只含有那些闭包返回 true 的元素的新迭代器
   + 闭包从环境中捕获了 shoe_size 变量并使用其值与每一只鞋的大小作比较，只保留指定大小的鞋子
3. 调用 _collect_ 将迭代器适配器返回的值收集进一个 vector 并返回
   
