html/rust/fp.html

<div id="outline-container-orgfe31747" class="outline-3">
<h3 id="orgfe31747">Iterator trait 和 next 方法</h3>
<div class="outline-text-3" id="text-orgfe31747">
<p>
迭代器都实现了一个叫做 <span class="underline">Iterator</span> 的定义于 <span class="underline">标准库</span> 的 trait。这个 trait 的定义看起来像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">trait</span> <span style="color: #98f5ff;">Iterator</span> {
    <span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Item</span>;

    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">next</span>(&amp;<span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">Self</span>::<span style="color: #98f5ff;">Item</span>&gt;;

    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27492;&#22788;&#30465;&#30053;&#20102;&#26041;&#27861;&#30340;&#40664;&#35748;&#23454;&#29616;</span>
}
</pre>
</div>

<pre class="example">
   注意这里有一下还未讲到的新语法：type Item 和 Self::Item，他们定义了 trait 的 关联类型
   
   现在只需知道这段代码表明实现 Iterator trait 要求同时定义一个 Item 类型，这个 Item 类型被用作 next 方法的返回值类型
   
   换句话说，Item 类型将是迭代器返回元素的类型
</pre>

<p>
<span class="underline">next</span> 是 Iterator 实现者被要求定义的唯一方法：
</p>
<ul class="org-ul">
<li>next <b>一次</b> 返回迭代器中的一个项，封装在 <span class="underline">Some</span> 中</li>
<li>当迭代器 <b>结束</b> 时，它返回 <span class="underline">None</span></li>
</ul>

<p>
可以直接调用迭代器的 next 方法；
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">iterator_demonstration</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">v1_iter</span> = v1.iter();

    <span style="color: #ffd700;">assert_eq!</span>(v1_iter.next(), <span style="color: #98f5ff;">Some</span>(&amp;1));
    <span style="color: #ffd700;">assert_eq!</span>(v1_iter.next(), <span style="color: #98f5ff;">Some</span>(&amp;2));
    <span style="color: #ffd700;">assert_eq!</span>(v1_iter.next(), <span style="color: #98f5ff;">Some</span>(&amp;3));
    <span style="color: #ffd700;">assert_eq!</span>(v1_iter.next(), <span style="color: #98f5ff;">None</span>);
}
</pre>
</div>

<p>
注意：v1_iter 必须是 <b>可变</b> 的：在迭代器上调用 <span class="underline">next</span> 方法 <b>改变</b> 了迭代器中用来记录 <span class="underline">序列位置</span> 的状态。换句话说，每一个 next 调用都会从迭代器中消费一个项
</p>
<pre class="example">
  使用 for 循环时无需使 v1_iter 可变因为 for 循环会获取 v1_iter 的所有权并在后台使 v1_iter 可变
</pre>

<p>
另外从 next <span class="underline">调用中得到的值</span> 是 vector 的 <b>不可变引用</b> 
</p>

<pre class="example">
iter 方法生成一个不可变引用的迭代器

如果需要一个获取 v1 所有权并返回拥有所有权的迭代器，则可以调用 into_iter 而不是 iter

类似的，如果希望迭代可变引用，则可以调用 iter_mut 而不是 iter
</pre>
</div>
</div>

<div id="outline-container-org315fe3f" class="outline-3">
<h3 id="org315fe3f">消费迭代器的方法</h3>
<div class="outline-text-3" id="text-org315fe3f">
<pre class="example">
Iterator trait 有一系列不同的由标准库提供默认实现的方法，可以在 Iterator trait 的标准库 API 文档中找到所有这些方法

一些方法在其定义中调用了 next 方法，这也就是为什么在实现 Iterator trait 时要求实现 next 方法的原因
</pre>
<p>
这些调用 next 方法的方法被称为 <span class="underline">消费适配器</span> ，因为调用他们会消耗迭代器。一个消费适配器的例子是 <span class="underline">sum</span> 方法。这个方法获取迭代器的所有权并反复调用 next 来遍历迭代器，因而会消费迭代器。当其遍历每一个项时，它将每一个项加总到一个总和并在迭代完成时返回总和：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">iterator_sum</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1_iter</span> = v1.iter();

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">total</span>: <span style="color: #98f5ff;">i32</span> = v1_iter.sum();

    <span style="color: #ffd700;">assert_eq!</span>(total, 6);
}
</pre>
</div>

<p>
注意：调用 sum 之后 <b>不再允许使用</b> v1_iter， 因为调用 sum 时它会 <b>获取</b> <span class="underline">迭代器的所有权</span> 
</p>
</div>
</div>

<div id="outline-container-orgfca12df" class="outline-3">
<h3 id="orgfca12df">产生其他迭代器的方法</h3>
<div class="outline-text-3" id="text-orgfca12df">
<p>
Iterator trait 中定义了另一类方法，被称为 <span class="underline">迭代器适配器</span> ，他们允许将 <span class="underline">当前迭代器</span> 变为 <span class="underline">不同类型的迭代器</span> 。可以 <span class="underline">链式</span> 调用多个迭代器适配器。不过因为所有的迭代器都是惰性的，必须调用一个消费适配器方法以便获取迭代器适配器调用的结果
</p>

<p>
下面展示了一个调用迭代器适配器方法 map 的例子，该 map 方法使用 <span class="underline">闭包</span> 来调用每个元素以生成新的迭代器。 这里的闭包创建了一个新的迭代器，对其中 vector 中的每个元素都被加 1：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span>: <span style="color: #98f5ff;">Vec</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

v1.iter().map(|x| x + 1);
</pre>
</div>

<p>
不过这些代码会产生一个警告：
</p>

<div class="org-src-container">
<pre class="src src-sh">warning: unused <span style="color: #fa8072;">`std::iter::Map`</span> which must be used: iterator adaptors are lazy
and do nothing unless consumed
 --&gt; src/main.rs:4:5
  |
4 |     v1.iter().map(|x| x + 1);
  |     ^^^^^^^^^^^^^^^^^^^^^^^^^
  |
  = note: <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">[warn(unused_must_use)] on by default</span>
</pre>
</div>

<pre class="example">
   上面的代码实际上并没有做任何事；所指定的闭包从未被调用过
   
   警告提醒了：迭代器适配器是惰性的，而这里需要消费迭代器
</pre>

<p>
为了修复这个警告并消费迭代器获取有用的结果，可以使用 collect 方法。这个方法消费迭代器并将结果收集到一个数据结构中：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v1</span>: <span style="color: #98f5ff;">Vec</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; = <span style="color: #ffd700;">vec!</span>[1, 2, 3];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v2</span>: <span style="color: #98f5ff;">Vec</span>&lt;_&gt; = v1.iter().map(|x| x + 1).collect();

<span style="color: #ffd700;">assert_eq!</span>(v2, <span style="color: #ffd700;">vec!</span>[2, 3, 4]);
</pre>
</div>

<pre class="example">
   因为传递给 map 的是一个闭包，可以指定任何希望在遍历的每个元素上执行的操作
   
   这是一个展示如何使用闭包来自定义行为同时又复用 Iterator trait 提供的迭代行为的绝佳例子
</pre>
</div>
</div>

<div id="outline-container-org2c04e4b" class="outline-3">
<h3 id="org2c04e4b">使用闭包获取环境</h3>
<div class="outline-text-3" id="text-org2c04e4b">
<p>
展示一个通过使用 filter 迭代器适配器和捕获环境的闭包的常规用例。迭代器的 <span class="underline">filter</span> 方法需要一个使用迭代器的 <span class="underline">每一个项</span> 并返回 <span class="underline">布尔值</span> 的 <span class="underline">闭包</span> ：
</p>
<ul class="org-ul">
<li>如果闭包返回 true：其值将会包含在 filter 提供的新迭代器中</li>
<li>如果闭包返回 false：其值不会包含在结果迭代器中</li>
</ul>

<p>
下面展示了使用 filter 和一个捕获环境中变量 shoe_size 的闭包，这样闭包就可以遍历一个 Shoe 结构体集合以便只返回指定大小的鞋子：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[derive(PartialEq, Debug)]</span>
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Shoe</span> {
    <span style="color: #4eee94;">size</span>: <span style="color: #98f5ff;">u32</span>,
    <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>,
}

<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">shoes_in_my_size</span>(<span style="color: #4eee94;">shoes</span>: <span style="color: #98f5ff;">Vec</span>&lt;<span style="color: #98f5ff;">Shoe</span>&gt;, <span style="color: #4eee94;">shoe_size</span>: <span style="color: #98f5ff;">u32</span>) -&gt; <span style="color: #98f5ff;">Vec</span>&lt;<span style="color: #98f5ff;">Shoe</span>&gt; {
    shoes.into_iter()
        .filter(|s| s.size == shoe_size)
        .collect()
}

<span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">filters_by_size</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">shoes</span> = <span style="color: #ffd700;">vec!</span>[
        <span style="color: #98f5ff;">Shoe</span> { <span style="color: #4eee94;">size</span>: 10, <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"sneaker"</span>) },
        <span style="color: #98f5ff;">Shoe</span> { <span style="color: #4eee94;">size</span>: 13, <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"sandal"</span>) },
        <span style="color: #98f5ff;">Shoe</span> { <span style="color: #4eee94;">size</span>: 10, <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"boot"</span>) },
    ];

    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">in_my_size</span> = shoes_in_my_size(shoes, 10);

    <span style="color: #ffd700;">assert_eq!</span>(
        in_my_size,
        <span style="color: #ffd700;">vec!</span>[
            <span style="color: #98f5ff;">Shoe</span> { <span style="color: #4eee94;">size</span>: 10, <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"sneaker"</span>) },
            <span style="color: #98f5ff;">Shoe</span> { <span style="color: #4eee94;">size</span>: 10, <span style="color: #4eee94;">style</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"boot"</span>) },
        ]
    );
}
</pre>
</div>

<p>
shoes_in_my_size 函数获取一个鞋子 vector 的所有权和一个鞋子大小作为参数。它返回一个只包含指定大小鞋子的 vector：
</p>
<ol class="org-ol">
<li>shoes_in_my_size 函数体中调用了 into_iter 来创建一个获取 <span class="underline">vector 所有权</span> 的迭代器</li>
<li>调用 filter 将这个迭代器适配成一个只含有那些闭包返回 true 的元素的新迭代器
<ul class="org-ul">
<li>闭包从环境中捕获了 shoe_size 变量并使用其值与每一只鞋的大小作比较，只保留指定大小的鞋子</li>
</ul></li>
<li>调用 <span class="underline">collect</span> 将迭代器适配器返回的值收集进一个 vector 并返回</li>
</ol>
</div>
</div>
