src/rust/fp.org
** 创建自定义迭代器
   #+BEGIN_EXAMPLE
   已经展示了可以通过在 vector 上调用 iter、into_iter 或 iter_mut 来创建一个迭代器
   
   也可以用标准库中其他的集合类型创建迭代器，比如哈希 map
   #+END_EXAMPLE
   此外可以 *实现* _Iterator trait_ 来创建任何希望的迭代器。只需要 *定义* 中唯一要求提供的方法就是 _next_ 方法。一旦定义了它，就可以使用所有其他由 Iterator trait 提供的拥有默认实现的方法来创建自定义迭代器了！
   
   #+BEGIN_EXAMPLE
   作为展示，创建一个只会从 1 数到 5 的迭代器
   
   首先，创建一个结构体来存放一些值
   
   接着实现 Iterator trait 将这个结构体放入迭代器中并在此实现中使用其值
   #+END_EXAMPLE
   定义一个 Counter 结构体和创建 Counter 实例的关联函数 new：
   
   #+BEGIN_SRC rust 
  struct Counter {
      count: u32,
  }

  impl Counter {
      fn new() -> Counter {
	  Counter { count: 0 }
      }
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   Counter 结构体有一个字段 count。这个字段存放一个 u32 值，它会记录处理 1 到 5 的迭代过程中的位置
   
   count 是私有的因为希望 Counter 的实现来管理这个值
   
   new 函数通过总是从为 0 的 count 字段开始新实例来确保需要的行为
   #+END_EXAMPLE
   
   为 Counter 类型实现 Iterator trait，通过定义 next 方法来指定使用迭代器时的行为：
   
   #+BEGIN_SRC rust 
  impl Iterator for Counter {
      type Item = u32;

      fn next(&mut self) -> Option<Self::Item> {
	  self.count += 1;

	  if self.count < 6 {
	      Some(self.count)
	  } else {
	      None
	  }
      }
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这里将迭代器的关联类型 Item 设置为 u32，意味着迭代器会返回 u32 值集合
   
   再一次，这里仍无需担心关联类型
   #+END_EXAMPLE
   
   希望迭代器对其内部状态加一，这也就是为何将 count 初始化为 0：
+ 希望迭代器首先返回 1。如果 count 值小于 6，next 会返回封装在 Some 中的当前值
+ 如果 count 大于或等于 6，迭代器会返回 None
  
*** 使用 Counter 迭代器的 next 方法 
    下面展示了一个测试用来演示如何通过直接调用 next 方法来使用 Counter 结构体的迭代器：
    
    #+BEGIN_SRC rust 
  #[test]
  fn calling_next_directly() {
      let mut counter = Counter::new();

      assert_eq!(counter.next(), Some(1));
      assert_eq!(counter.next(), Some(2));
      assert_eq!(counter.next(), Some(3));
      assert_eq!(counter.next(), Some(4));
      assert_eq!(counter.next(), Some(5));
      assert_eq!(counter.next(), None);
  }
    #+END_SRC
    
*** 使用自定义迭代器中其他 Iterator trait 方法
    通过定义 next 方法实现 Iterator trait，现在就可以使用任何标准库定义的拥有默认实现的 Iterator trait 方法了，因为他们都使用了 next 方法的功能
    
    #+BEGIN_EXAMPLE
    例如，出于某种原因希望获取 Counter 实例产生的值，将这些值与另一个 Counter 实例在省略了第一个值之后产生的值配对
    
    将每一对值相乘，只保留那些可以被三整除的结果，然后将所有保留的结果相加
    #+END_EXAMPLE
    
    #+BEGIN_SRC rust 
  #[test]
  fn using_other_iterator_trait_methods() {
      let sum: u32 = Counter::new().zip(Counter::new().skip(1))
				   .map(|(a, b)| a * b)
				   .filter(|x| x % 3 == 0)
				   .sum();
      assert_eq!(18, sum);
  }
    #+END_SRC
    
    注意 zip 只产生四对值；第五对值 _(5, None)_ *从未被产生* ，因为 zip 在任一输入迭代器返回 None 时也返回 None。
    
    #+BEGIN_EXAMPLE
    只要指定了 next 方法如何工作，而标准库则提供了其它调用 next 的方法的默认实现
    #+END_EXAMPLE
    
* 改进 minigrep 项目
  #+BEGIN_EXAMPLE
  有了这些关于迭代器的新知识，可以使用迭代器来改进上一章中 I/O 项目的实现来使得代码更简洁明了
  #+END_EXAMPLE
  
** 使用迭代器并去掉 clone
   上一章中 Config::new 的实现：
   
   #+BEGIN_SRC rust 
  impl Config {
      pub fn new(args: &[String]) -> Result<Config, &'static str> {
          if args.len() < 3 {
              return Err("not enough arguments");
          }

          let query = args[1].clone();
          let filename = args[2].clone();

          let case_sensitive = env::var("CASE_INSENSITIVE").is_err();

          Ok(Config { query, filename, case_sensitive })
      }
  }
   #+END_SRC
   
   #+BEGIN_EXAMPLE
   这里需要 clone 的原因是参数 args 中有一个 String 元素的 slice，而 new 函数并不拥有 args
   
   为了能够返回 Config 实例的所有权，需要克隆 Config 中字段 query 和 filename 的值，这样 Config 实例就能拥有这些值
   #+END_EXAMPLE
   
   在学习了迭代器之后，可以将 new 函数改为 *获取* 一个有 _所有权_ 的 _迭代器_ 作为参数而不是 _借用 slice_ 
   
   #+BEGIN_EXAMPLE
   使用迭代器来检查 slice 长度和索引特定位置的代码，这会明确 Config::new 的工作因为迭代器会负责访问这些值
   
   一旦 Config::new 获取了迭代器的所有权并不再使用借用的索引操作，就可以将迭代器中的 String 值移动到 Config 中，而不是调用 clone 分配新的空间
   #+END_EXAMPLE
   
