html/rust/fp.html

<div id="outline-container-org93343a2" class="outline-3">
<h3 id="org93343a2">创建自定义迭代器</h3>
<div class="outline-text-3" id="text-org93343a2">
<pre class="example">
   已经展示了可以通过在 vector 上调用 iter、into_iter 或 iter_mut 来创建一个迭代器
   
   也可以用标准库中其他的集合类型创建迭代器，比如哈希 map
</pre>
<p>
此外可以 <b>实现</b> <span class="underline">Iterator trait</span> 来创建任何希望的迭代器。只需要 <b>定义</b> 中唯一要求提供的方法就是 <span class="underline">next</span> 方法。一旦定义了它，就可以使用所有其他由 Iterator trait 提供的拥有默认实现的方法来创建自定义迭代器了！
</p>

<pre class="example">
   作为展示，创建一个只会从 1 数到 5 的迭代器
   
   首先，创建一个结构体来存放一些值
   
   接着实现 Iterator trait 将这个结构体放入迭代器中并在此实现中使用其值
</pre>
<p>
定义一个 Counter 结构体和创建 Counter 实例的关联函数 new：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Counter</span> {
    <span style="color: #4eee94;">count</span>: <span style="color: #98f5ff;">u32</span>,
}

<span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Counter</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">new</span>() -&gt; <span style="color: #98f5ff;">Counter</span> {
        <span style="color: #98f5ff;">Counter</span> { <span style="color: #4eee94;">count</span>: 0 }
    }
}
</pre>
</div>

<pre class="example">
Counter 结构体有一个字段 count。这个字段存放一个 u32 值，它会记录处理 1 到 5 的迭代过程中的位置

count 是私有的因为希望 Counter 的实现来管理这个值

new 函数通过总是从为 0 的 count 字段开始新实例来确保需要的行为
</pre>

<p>
为 Counter 类型实现 Iterator trait，通过定义 next 方法来指定使用迭代器时的行为：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Iterator</span> <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #98f5ff;">Counter</span> {
    <span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Item</span> = <span style="color: #98f5ff;">u32</span>;

    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">next</span>(&amp;<span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #00bfff; font-weight: bold;">self</span>) -&gt; <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">Self</span>::<span style="color: #98f5ff;">Item</span>&gt; {
        <span style="color: #00bfff; font-weight: bold;">self</span>.count += 1;

        <span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #00bfff; font-weight: bold;">self</span>.count &lt; 6 {
            <span style="color: #98f5ff;">Some</span>(<span style="color: #00bfff; font-weight: bold;">self</span>.count)
        } <span style="color: #00bfff; font-weight: bold;">else</span> {
            <span style="color: #98f5ff;">None</span>
        }
    }
}
</pre>
</div>

<pre class="example">
   这里将迭代器的关联类型 Item 设置为 u32，意味着迭代器会返回 u32 值集合
   
   再一次，这里仍无需担心关联类型
</pre>

<p>
希望迭代器对其内部状态加一，这也就是为何将 count 初始化为 0：
</p>
<ul class="org-ul">
<li>希望迭代器首先返回 1。如果 count 值小于 6，next 会返回封装在 Some 中的当前值</li>
<li>如果 count 大于或等于 6，迭代器会返回 None</li>
</ul>
</div>

<div id="outline-container-org88e1f76" class="outline-4">
<h4 id="org88e1f76">使用 Counter 迭代器的 next 方法</h4>
<div class="outline-text-4" id="text-org88e1f76">
<p>
下面展示了一个测试用来演示如何通过直接调用 next 方法来使用 Counter 结构体的迭代器：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">calling_next_directly</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">counter</span> = <span style="color: #98f5ff;">Counter</span>::new();

    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">Some</span>(1));
    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">Some</span>(2));
    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">Some</span>(3));
    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">Some</span>(4));
    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">Some</span>(5));
    <span style="color: #ffd700;">assert_eq!</span>(counter.next(), <span style="color: #98f5ff;">None</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org42ef8a0" class="outline-4">
<h4 id="org42ef8a0">使用自定义迭代器中其他 Iterator trait 方法</h4>
<div class="outline-text-4" id="text-org42ef8a0">
<p>
通过定义 next 方法实现 Iterator trait，现在就可以使用任何标准库定义的拥有默认实现的 Iterator trait 方法了，因为他们都使用了 next 方法的功能
</p>

<pre class="example">
    例如，出于某种原因希望获取 Counter 实例产生的值，将这些值与另一个 Counter 实例在省略了第一个值之后产生的值配对
    
    将每一对值相乘，只保留那些可以被三整除的结果，然后将所有保留的结果相加
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#[test]</span>
<span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">using_other_iterator_trait_methods</span>() {
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">sum</span>: <span style="color: #98f5ff;">u32</span> = <span style="color: #98f5ff;">Counter</span>::new().zip(<span style="color: #98f5ff;">Counter</span>::new().skip(1))
                                 .map(|(a, b)| a * b)
                                 .filter(|x| x % 3 == 0)
                                 .sum();
    <span style="color: #ffd700;">assert_eq!</span>(18, sum);
}
</pre>
</div>

<p>
注意 zip 只产生四对值；第五对值 <span class="underline">(5, None)</span> <b>从未被产生</b> ，因为 zip 在任一输入迭代器返回 None 时也返回 None。
</p>

<pre class="example">
    只要指定了 next 方法如何工作，而标准库则提供了其它调用 next 的方法的默认实现
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4fefb69" class="outline-2">
<h2 id="org4fefb69">改进 minigrep 项目</h2>
<div class="outline-text-2" id="text-org4fefb69">
<pre class="example">
  有了这些关于迭代器的新知识，可以使用迭代器来改进上一章中 I/O 项目的实现来使得代码更简洁明了
</pre>
</div>

<div id="outline-container-org4fe701f" class="outline-3">
<h3 id="org4fe701f">使用迭代器并去掉 clone</h3>
<div class="outline-text-3" id="text-org4fe701f">
<p>
上一章中 Config::new 的实现：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Config</span> {
    <span style="color: #00bfff; font-weight: bold;">pub</span> <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">new</span>(<span style="color: #4eee94;">args</span>: &amp;[<span style="color: #98f5ff;">String</span>]) -&gt; <span style="color: #98f5ff;">Result</span>&lt;<span style="color: #98f5ff;">Config</span>, &amp;'<span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">str</span>&gt; {
        <span style="color: #00bfff; font-weight: bold;">if</span> args.len() &lt; 3 {
            <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #98f5ff;">Err</span>(<span style="color: #deb887;">"not enough arguments"</span>);
        }

        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">query</span> = args[1].clone();
        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">filename</span> = args[2].clone();

        <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">case_sensitive</span> = <span style="color: #ffd700;">env</span>::var(<span style="color: #deb887;">"CASE_INSENSITIVE"</span>).is_err();

        <span style="color: #98f5ff;">Ok</span>(<span style="color: #98f5ff;">Config</span> { query, filename, case_sensitive })
    }
}
</pre>
</div>

<pre class="example">
   这里需要 clone 的原因是参数 args 中有一个 String 元素的 slice，而 new 函数并不拥有 args
   
   为了能够返回 Config 实例的所有权，需要克隆 Config 中字段 query 和 filename 的值，这样 Config 实例就能拥有这些值
</pre>

<p>
在学习了迭代器之后，可以将 new 函数改为 <b>获取</b> 一个有 <span class="underline">所有权</span> 的 <span class="underline">迭代器</span> 作为参数而不是 <span class="underline">借用 slice</span> 
</p>

<pre class="example">
   使用迭代器来检查 slice 长度和索引特定位置的代码，这会明确 Config::new 的工作因为迭代器会负责访问这些值
   
   一旦 Config::new 获取了迭代器的所有权并不再使用借用的索引操作，就可以将迭代器中的 String 值移动到 Config 中，而不是调用 clone 分配新的空间
</pre>
</div>
